Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4C32E_0.xml
        <register caption="Status Register" name="RSWDT_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Watchdog Underflow" mask="0x00000001" name="WDUNF"/>
          <bitfield caption="Watchdog Error" mask="0x00000002" name="WDERR"/>
        </register>
      </register-group>
    </module>
    <module caption="Real-time Clock" name="RTC" version="6056O">
      <register-group name="RTC">
        <register caption="Control Register" name="RTC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Update Request Time Register" mask="0x00000001" name="UPDTIM"/>
          <bitfield caption="Update Request Calendar Register" mask="0x00000002" name="UPDCAL"/>
          <bitfield caption="Time Event Selection" mask="0x00000300" name="TIMEVSEL" values="RTC_CR__TIMEVSEL"/>
          <bitfield caption="Calendar Event Selection" mask="0x00030000" name="CALEVSEL" values="RTC_CR__CALEVSEL"/>
        </register>
        <register caption="Mode Register" name="RTC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="12-/24-hour Mode" mask="0x00000001" name="HRMOD"/>
          <bitfield caption="PERSIAN Calendar" mask="0x00000002" name="PERSIAN"/>
          <bitfield caption="NEGative PPM Correction" mask="0x00000010" name="NEGPPM"/>
          <bitfield caption="Slow Clock Correction" mask="0x00007F00" name="CORRECTION"/>
          <bitfield caption="HIGH PPM Correction" mask="0x00008000" name="HIGHPPM"/>
          <bitfield caption="RTCOUT0 OutputSource Selection" mask="0x00070000" name="OUT0" values="RTC_MR__OUT0"/>
          <bitfield caption="High Duration of the Output Pulse" mask="0x07000000" name="THIGH" values="RTC_MR__THIGH"/>
          <bitfield caption="Period of the Output Pulse" mask="0x30000000" name="TPERIOD" values="RTC_MR__TPERIOD"/>
        </register>
        <register caption="Time Register" name="RTC_TIMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Current Second" mask="0x0000007F" name="SEC"/>
          <bitfield caption="Current Minute" mask="0x00007F00" name="MIN"/>
          <bitfield caption="Current Hour" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="Ante Meridiem Post Meridiem Indicator" mask="0x00400000" name="AMPM"/>
        </register>
        <register caption="Calendar Register" name="RTC_CALR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Current Century" mask="0x0000007F" name="CENT"/>
          <bitfield caption="Current Year" mask="0x0000FF00" name="YEAR"/>
          <bitfield caption="Current Month" mask="0x001F0000" name="MONTH"/>
          <bitfield caption="Current Day in Current Week" mask="0x00E00000" name="DAY"/>
          <bitfield caption="Current Day in Current Month" mask="0x3F000000" name="DATE"/>
        </register>
        <register caption="Time Alarm Register" name="RTC_TIMALR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Second Alarm" mask="0x0000007F" name="SEC"/>
          <bitfield caption="Second Alarm Enable" mask="0x00000080" name="SECEN"/>
          <bitfield caption="Minute Alarm" mask="0x00007F00" name="MIN"/>
          <bitfield caption="Minute Alarm Enable" mask="0x00008000" name="MINEN"/>
          <bitfield caption="Hour Alarm" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="AM/PM Indicator" mask="0x00400000" name="AMPM"/>
          <bitfield caption="Hour Alarm Enable" mask="0x00800000" name="HOUREN"/>
        </register>
        <register caption="Calendar Alarm Register" name="RTC_CALALR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Month Alarm" mask="0x001F0000" name="MONTH"/>
          <bitfield caption="Month Alarm Enable" mask="0x00800000" name="MTHEN"/>
          <bitfield caption="Date Alarm" mask="0x3F000000" name="DATE"/>
          <bitfield caption="Date Alarm Enable" mask="0x80000000" name="DATEEN"/>
        </register>
        <register caption="Status Register" name="RTC_SR" offset="0x18" rw="R" size="4">
          <bitfield caption="Acknowledge for Update" mask="0x00000001" name="ACKUPD" values="RTC_SR__ACKUPD"/>
          <bitfield caption="Alarm Flag" mask="0x00000002" name="ALARM" values="RTC_SR__ALARM"/>
          <bitfield caption="Second Event" mask="0x00000004" name="SEC" values="RTC_SR__SEC"/>
          <bitfield caption="Time Event" mask="0x00000008" name="TIMEV" values="RTC_SR__TIMEV"/>
          <bitfield caption="Calendar Event" mask="0x00000010" name="CALEV" values="RTC_SR__CALEV"/>
          <bitfield caption="Time and/or Date Free Running Error" mask="0x00000020" name="TDERR" values="RTC_SR__TDERR"/>
        </register>
        <register caption="Status Clear Command Register" name="RTC_SCCR" offset="0x1C" rw="W" size="4">
          <bitfield caption="Acknowledge Clear" mask="0x00000001" name="ACKCLR"/>
          <bitfield caption="Alarm Clear" mask="0x00000002" name="ALRCLR"/>
          <bitfield caption="Second Clear" mask="0x00000004" name="SECCLR"/>
          <bitfield caption="Time Clear" mask="0x00000008" name="TIMCLR"/>
          <bitfield caption="Calendar Clear" mask="0x00000010" name="CALCLR"/>
          <bitfield caption="Time and/or Date Free Running Error Clear" mask="0x00000020" name="TDERRCLR"/>
        </register>
        <register caption="Interrupt Enable Register" name="RTC_IER" offset="0x20" rw="W" size="4">
          <bitfield caption="Acknowledge Update Interrupt Enable" mask="0x00000001" name="ACKEN"/>
          <bitfield caption="Alarm Interrupt Enable" mask="0x00000002" name="ALREN"/>
          <bitfield caption="Second Event Interrupt Enable" mask="0x00000004" name="SECEN"/>
          <bitfield caption="Time Event Interrupt Enable" mask="0x00000008" name="TIMEN"/>
          <bitfield caption="Calendar Event Interrupt Enable" mask="0x00000010" name="CALEN"/>
          <bitfield caption="Time and/or Date Error Interrupt Enable" mask="0x00000020" name="TDERREN"/>
        </register>
        <register caption="Interrupt Disable Register" name="RTC_IDR" offset="0x24" rw="W" size="4">
          <bitfield caption="Acknowledge Update Interrupt Disable" mask="0x00000001" name="ACKDIS"/>
          <bitfield caption="Alarm Interrupt Disable" mask="0x00000002" name="ALRDIS"/>
          <bitfield caption="Second Event Interrupt Disable" mask="0x00000004" name="SECDIS"/>
          <bitfield caption="Time Event Interrupt Disable" mask="0x00000008" name="TIMDIS"/>
          <bitfield caption="Calendar Event Interrupt Disable" mask="0x00000010" name="CALDIS"/>
          <bitfield caption="Time and/or Date Error Interrupt Disable" mask="0x00000020" name="TDERRDIS"/>
        </register>
        <register caption="Interrupt Mask Register" name="RTC_IMR" offset="0x28" rw="R" size="4">
          <bitfield caption="Acknowledge Update Interrupt Mask" mask="0x00000001" name="ACK"/>
          <bitfield caption="Alarm Interrupt Mask" mask="0x00000002" name="ALR"/>
          <bitfield caption="Second Event Interrupt Mask" mask="0x00000004" name="SEC"/>
          <bitfield caption="Time Event Interrupt Mask" mask="0x00000008" name="TIM"/>
          <bitfield caption="Calendar Event Interrupt Mask" mask="0x00000010" name="CAL"/>
        </register>
        <register caption="Valid Entry Register" name="RTC_VER" offset="0x2C" rw="R" size="4">
          <bitfield caption="Non-valid Time" mask="0x00000001" name="NVTIM"/>
          <bitfield caption="Non-valid Calendar" mask="0x00000002" name="NVCAL"/>
          <bitfield caption="Non-valid Time Alarm" mask="0x00000004" name="NVTIMALR"/>
          <bitfield caption="Non-valid Calendar Alarm" mask="0x00000008" name="NVCALALR"/>
        </register>
        <register caption="TimeStamp Time Register 0" name="RTC_TSTR0" offset="0xB0" rw="R" size="4">
          <bitfield caption="SEConds of the tamper" mask="0x0000007F" name="SEC"/>
          <bitfield caption="MINutes of the tamper" mask="0x00007F00" name="MIN"/>
          <bitfield caption="HOURs of the tamper" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="AMPM indicator of the tamper" mask="0x00400000" name="AMPM"/>
          <bitfield caption="Tamper events counter" mask="0x0F000000" name="TEVCNT"/>
          <bitfield caption="system mode of the tamper" mask="0x80000000" name="BACKUP"/>
        </register>
